# EditShaderRecord

## Description
Brings up the edit shader dialog for this shader.  Returns true if the user pressed the OK button to dismiss the dialog.

```pascal
FUNCTION EditShaderRecord(shaderRecord : HANDLE): BOOLEAN;
```

```python
def vs.EditShaderRecord(shaderRecord):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|shaderRecord|HANDLE|The shader record to edit.|

## Version
Availability: from VectorWorks10.1

## Category
* Textures